study/QnA.org
#+TITLE: Linux kernel 분석 QnA
#+AUTHOR: Chun SH
#+EMAIL: simplenfast@gmail.com
#+LANGUAGE: ko
#+OPTIONS: author:nil timestamp:nil
#+OPTIONS: H:3 \n:nil @:t ::t |:t ^:t -:t f:t *:tl creator:nil

* linux 3.2 커널 부팅과정 순서 (파일)
- SETUP : [[file:../arch/x86/boot/header.S::globl%20_start][boot/header.S]] - [[file:../arch/x86/boot/main.c::void%20main%20void][boot/main.c]] - [[file:../arch/x86/boot/pm.c::void%20go_to_protected_mode%20void][boot/pm.c]] - [[file:../arch/x86/boot/pmjump.S::GLOBAL%20protected_mode_jump][boot/pmjump.S]]
- COMPRESSED : [[file:../arch/x86/boot/compressed/head_64.S::ENTRY%20startup_32][compressed/head_64.S]]
- KERNEL : [[file:../arch/x86/kernel/head_64.S::startup_64][kernel/head_64.S]] - [[file:../arch/x86/kernel/head64.c::void%20__init%20x86_64_start_kernel%20char%20real_mode_data][kernel/head64.c]] - [[file:../init/main.c::asmlinkage%20void%20__init%20start_kernel%20void][init/main.c]]

* 리눅스는 파라미터를 어떻게 전달받는가?

- boot loader로부터 커널의 header에 위치한 BOOT PROTOCOL 정보를 통해 전달받는다.

[[file:../arch/x86/boot/header.S::section%20header%20a][header.s]] 

[[file:../Documentation/x86/boot.txt::The%20header%20looks%20like][boot protocol]]

* GAS 어셈에서 1f, 1b가 의미하는 바는?

- 앞의 숫자는 임시 레이블, f는 앞, b는 뒤쪽에서 가장 가까운 레이블 주소를 나타낸다.

[[http://sourceware.org/binutils/docs-2.22/as/Symbol-Names.html#Symbol-Names][GAS Symbol names]]

* 상수 뒤에 붙는 ULL과 LL은 무엇인가?

- unsigned long long integer, long long integer (최소 64bit) 로 데이터형을 명시한다.

[[http://www.cinsk.org/cfaqs/html/node3.html#SECTION00310000000000000000][C FAQS 한글 번역-Basic type]]

* x86 커널이 함수를 호출할때 사용하는 함수 호출 규약은?

- regparm으로 정의한다. gcc 32비트에서 regparm=3 이면 EAX, EDX, ECX를 인자전달에 사용한다.

[[file:../arch/x86/include/asm/calling.h][calling convention]]

* (rdmsr) MSR의 0xc0010015의 15번 비트를 0으로 하는건 어떤 의미인가?

- MSR은 CPU에 따른 정보를 변경/저장하는 레지스터로 AMD의 0xC0010015는 HWCR(Hardware Configuration Register)이다. 15번 비트가 0이면 SSE instruction을 켠다.

[[http://support.amd.com/us/Processor_TechDocs/26094.PDF][BIOS and Kernel Developer's Guid for AMD Athlon 64]]

* int 0x15 AX=0xec00, BX=2로 Long mode Taget을 지정하는건 어떠한 의미인가?

- BIOS에 앞으로 Long mode(64bits)로 동작할것을 알려준다. Long mode로 변환하기 전에 BSP에 의해 한번만 실행된다.

* inline 어셈에서 output, input쪽에 있는 "=" "+" "&"는 무엇인가?

- "="는 write-only, "+"는 read-write, "&"는 early clobber(값이 바뀔수 있음을 알려준다.)

[[info:gcc:Modifiers]]

* Int 0x15 AX=0xe980, Intel speed step 인터럽트는 어떤 기능을 하는가?

- eax, ebx, ecx, edx에 값을 리턴한다. bx의 입력값은 0은 ownership, 0은 get, 1은 set 기능이다. (=GET_SPEEDSTEP_STATE=)

* =query_MCA= 에서 MCA(micro channel architecture) 정보는 무엇이고 왜 가져오는가?

- IBM의 ISA 후속 규격. EISA에 밀려 대중적이지는 않았던걸로 보인다. ah=0xc0, int 0x15는 시스템의 정보를 읽어오는것으로 보인다.

* return a=x; 이 리턴하는 것은 x인가 true 인가?

- x

* 비디오카드에서 DAC란 무엇인가?

- digital-to-analog 변환. D-sub등 아날로그 출력에서 필요한 과정으로 보인다.

* *%eax에서 *를 왜 넣는가?

- 절대주소를 쓸때 * 접두사를 붙여야한다. 기본은 상대주소를 사용한다.

[[http://wiki.osdev.org/Opcode_syntax][Opcode syntax]]

* offsetof란??????

- offsetof(a,b) 일때 a 구조체 내부의 b의 오프셋을 구하는 매크로

* kbuild.h에서 ->의 의미

- ->로 시작하는 부분을 sed를 사용해 define으로 치환한다. (ex. -> a b c 는 #define a b /* c */ 로 변환된다.)

[[file:../Kbuild::define%20sed%20y][kbuild]]

* 세그먼트에 32비트값을 넣을수 있는가?

- mov ds,cx와 mov ds,ecx를 컴파일 했을때의 기계어 코드는 같다. segment selector의 크기는 16비트기 때문에 같은 결과가 들어가는 것으로 보인다.

* 32모드에서 call할때의 크기

- 기본적으로 memory operand는 32비트다. 일반 호출시 스택에 증감되는 값도 32비트일 것이다.

* =MSR_IA32_MISC_ENABLE=

- x87 FPU 명령어 지원여부 P4에서 지원한다. 최근에는 지원하지 않는것 같다.

[[http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html][Intel manual Vol3, Table B-13]]

* PAE의 크기가 어떻게 36비트를 쓰는가?

- PAE의 엔트리의 물리 메모리 크기 제한(bits)은 아키텍쳐에 따라 가변적이다. Pentium pro에서부터 36비트를 지원하고 최대 52비트다. (테이블 크기가 4K라면 정렬로 엔트리에는 40비트 사용) 
   CPUID.80000008H:EAX[7:0]의 MAXPHYADDR로 크기를 얻을수 있다.

[[http://msdn.microsoft.com/en-us/windows/hardware/gg487512][msdn]] 

[[http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html][Intel manual Vol.3 4.1.4, 4.4]]

* RIP 상대 주소 지정방법 (RIP-relative addressing)

- 64비트 모드는 기본 오퍼렌드 크기가 32, 어드레스 크기는 64이기 때문에 다음 명령어 위치에 상대적인 주소지정법인 RIP 지정법이 생겼다.

[[http://kkamagui.tistory.com/781][64비트 멀티코어 OS 원리와 구조, p.87]]

