study/QnA.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<title>Linux kernel 분석 QnA</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Linux kernel 분석 QnA"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-15 10:39:44 KST"/>
<meta name="author" content="Chun SH"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Linux kernel 분석 QnA</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 linux 3.2 커널 부팅과정 순서 (파일)</a></li>
<li><a href="#sec-2">2 리눅스는 파라미터를 어떻게 전달받는가?</a></li>
<li><a href="#sec-3">3 GAS 어셈에서 1f, 1b가 의미하는 바는?</a></li>
<li><a href="#sec-4">4 상수 뒤에 붙는 ULL과 LL은 무엇인가?</a></li>
<li><a href="#sec-5">5 x86 커널이 함수를 호출할때 사용하는 함수 호출 규약은?</a></li>
<li><a href="#sec-6">6 (rdmsr) MSR의 0xc0010015의 15번 비트를 0으로 하는건 어떤 의미인가?</a></li>
<li><a href="#sec-7">7 int 0x15 AX=0xec00, BX=2로 Long mode Taget을 지정하는건 어떠한 의미인가?</a></li>
<li><a href="#sec-8">8 inline 어셈에서 output, input쪽에 있는 "=" "+" "&amp;"는 무엇인가?</a></li>
<li><a href="#sec-9">9 Int 0x15 AX=0xe980, Intel speed step 인터럽트는 어떤 기능을 하는가?</a></li>
<li><a href="#sec-10">10 query_MCA 에서 MCA(micro channel architecture) 정보는 무엇이고 왜 가져오는가?</a></li>
<li><a href="#sec-11">11 return a=x; 이 리턴하는 것은 x인가 true 인가?</a></li>
<li><a href="#sec-12">12 비디오카드에서 DAC란 무엇인가?</a></li>
<li><a href="#sec-13">13 *%eax에서 *를 왜 넣는가?</a></li>
<li><a href="#sec-14">14 offsetof란??????</a></li>
<li><a href="#sec-15">15 kbuild.h에서 -&gt;의 의미</a></li>
<li><a href="#sec-16">16 세그먼트에 32비트값을 넣을수 있는가?</a></li>
<li><a href="#sec-17">17 32모드에서 call할때의 크기</a></li>
<li><a href="#sec-18">18 <code>MSR_IA32_MISC_ENABLE</code></a></li>
<li><a href="#sec-19">19 PAE의 크기가 어떻게 36비트를 쓰는가?</a></li>
<li><a href="#sec-20">20 RIP 상대 주소 지정방법 (RIP-relative addressing)</a></li>
<li><a href="#sec-21">21 GOT란?</a></li>
<li><a href="#sec-22">22 <code>__builtin_constant_p</code></a></li>
<li><a href="#sec-23">23 <code>MSR_GS_BASE</code></a></li>
<li><a href="#sec-24">24 do { } while (0) 이 많이 쓰이는 이유</a></li>
<li><a href="#sec-25">25 inline 어셈에서 세번째 : 필드(list of clobbered registers)에서 "memory"와 "cc"의 의미</a></li>
<li><a href="#sec-26">26 inline 어셈에서 %h0, %b0 오퍼렌드의 의미</a></li>
<li><a href="#sec-27">27 inline 어셈에서 output, input 필드에 붙는 제약 ex) "=a"</a></li>
<li><a href="#sec-28">28 #define <code>__percpu_arg(x)</code>             <code>__percpu_prefix</code> "%P" #x</a></li>
<li><a href="#sec-29">29 #define # ##</a></li>
<li><a href="#sec-30">30 cgroup이란?</a></li>
<li><a href="#sec-31">31 <code>css_set</code></a></li>
<li><a href="#sec-32">32 응용프로그램에서 LMA와 VMA를 다르게 하면?</a></li>
<li><a href="#sec-33">33 매크로 함수의 리턴값</a></li>
<li><a href="#sec-34">34 RCU</a></li>
<li><a href="#sec-35">35 sparse란 무엇인가?</a></li>
<li><a href="#sec-36">36 <code>__force_order</code></a></li>
<li><a href="#sec-37">37 as의 .pushsection, .popsection, .previous</a></li>
<li><a href="#sec-38">38 const struct <code>cpu_dev</code> *const *cdev</a></li>
<li><a href="#sec-39">39 const int와 int *const의 차이</a></li>
<li><a href="#sec-40">40 intel vt 에서 ldtr을 세팅하면 intel vt가 happy한 이유는?</a></li>
<li><a href="#sec-41">41 cpu family 값</a></li>
<li><a href="#sec-42">42 <code>native_read_msr</code> 의 <code>EAX_EDX_VAL</code> 매크로에서 32/64비트를 "a" "d", "A"를 나눠놓은 이유</a></li>
<li><a href="#sec-43">43 <code>atomic_set</code> 에서 mov에는 왜 lock prefix가 안붙는가?</a></li>
<li><a href="#sec-44">44 <code>__this_fixmap_does_not_exist</code> 함수는 선언이 안되있는 이유?</a></li>
<li><a href="#sec-45">45 Write combining이란?</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> linux 3.2 커널 부팅과정 순서 (파일)</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>SETUP : <a href="../arch/x86/boot/header.S#globl-_start">boot/header.S</a> - <a href="../arch/x86/boot/main.c#void-main-void">boot/main.c</a> - <a href="../arch/x86/boot/pm.c#void-go_to_protected_mode-void">boot/pm.c</a> - <a href="../arch/x86/boot/pmjump.S#GLOBAL-protected_mode_jump">boot/pmjump.S</a>
</li>
<li>COMPRESSED : <a href="../arch/x86/boot/compressed/head_64.S#ENTRY-startup_32">compressed/head<sub>64</sub>.S</a>
</li>
<li>KERNEL : <a href="../arch/x86/kernel/head_64.S#startup_64">kernel/head<sub>64</sub>.S</a> - <a href="../arch/x86/kernel/head64.c#void-__init-x86_64_start_kernel-char-real_mode_data">kernel/head64.c</a> - <a href="../init/main.c#asmlinkage-void-__init-start_kernel-void">init/main.c</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 리눅스는 파라미터를 어떻게 전달받는가?</h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>boot loader로부터 커널의 header에 위치한 BOOT PROTOCOL 정보를 통해 전달받는다.
</li>
</ul>


<p>
<a href="../arch/x86/boot/header.S#section-header-a">header.s</a> 
</p>
<p>
<a href="../Documentation/x86/boot.txt#The-header-looks-like">boot protocol</a>
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> GAS 어셈에서 1f, 1b가 의미하는 바는?</h2>
<div class="outline-text-2" id="text-3">


<ul>
<li>앞의 숫자는 임시 레이블, f는 앞, b는 뒤쪽에서 가장 가까운 레이블 주소를 나타낸다.
</li>
</ul>


<p>
<a href="http://sourceware.org/binutils/docs-2.22/as/Symbol-Names.html#Symbol-Names">GAS Symbol names</a>
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 상수 뒤에 붙는 ULL과 LL은 무엇인가?</h2>
<div class="outline-text-2" id="text-4">


<ul>
<li>unsigned long long integer, long long integer (최소 64bit) 로 데이터형을 명시한다.
</li>
</ul>


<p>
<a href="http://www.cinsk.org/cfaqs/html/node3.html#SECTION00310000000000000000">C FAQS 한글 번역-Basic type</a>
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> x86 커널이 함수를 호출할때 사용하는 함수 호출 규약은?</h2>
<div class="outline-text-2" id="text-5">


<ul>
<li>regparm으로 정의한다. gcc 32비트에서 regparm=3 이면 EAX, EDX, ECX를 인자전달에 사용한다.
</li>
</ul>


<p>
<a href="../arch/x86/include/asm/calling.h">calling convention</a>
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> (rdmsr) MSR의 0xc0010015의 15번 비트를 0으로 하는건 어떤 의미인가?</h2>
<div class="outline-text-2" id="text-6">


<ul>
<li>MSR은 CPU에 따른 정보를 변경/저장하는 레지스터로 AMD의 0xC0010015는 HWCR(Hardware Configuration Register)이다. 15번 비트가 0이면 SSE instruction을 켠다.
</li>
</ul>


<p>
<a href="http://support.amd.com/us/Processor_TechDocs/26094.PDF">BIOS and Kernel Developer's Guid for AMD Athlon 64</a>
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> int 0x15 AX=0xec00, BX=2로 Long mode Taget을 지정하는건 어떠한 의미인가?</h2>
<div class="outline-text-2" id="text-7">


<ul>
<li>BIOS에 앞으로 Long mode(64bits)로 동작할것을 알려준다. Long mode로 변환하기 전에 BSP에 의해 한번만 실행된다.
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> inline 어셈에서 output, input쪽에 있는 "=" "+" "&amp;"는 무엇인가?</h2>
<div class="outline-text-2" id="text-8">


<ul>
<li>"="는 write-only, "+"는 read-write, "&amp;"는 early clobber(값이 바뀔수 있음을 알려준다.)
</li>
</ul>


<p>
<i>&lt;info:gcc:Modifiers&gt;</i>
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Int 0x15 AX=0xe980, Intel speed step 인터럽트는 어떤 기능을 하는가?</h2>
<div class="outline-text-2" id="text-9">


<ul>
<li>eax, ebx, ecx, edx에 값을 리턴한다. bx의 입력값은 0은 ownership, 0은 get, 1은 set 기능이다. (<code>GET_SPEEDSTEP_STATE</code>)
</li>
</ul>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> query_MCA 에서 MCA(micro channel architecture) 정보는 무엇이고 왜 가져오는가?</h2>
<div class="outline-text-2" id="text-10">


<ul>
<li>IBM의 ISA 후속 규격. EISA에 밀려 대중적이지는 않았던걸로 보인다. ah=0xc0, int 0x15는 시스템의 정보를 읽어오는것으로 보인다.
</li>
</ul>


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> return a=x; 이 리턴하는 것은 x인가 true 인가?</h2>
<div class="outline-text-2" id="text-11">


<ul>
<li>x
</li>
</ul>


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 비디오카드에서 DAC란 무엇인가?</h2>
<div class="outline-text-2" id="text-12">


<ul>
<li>digital-to-analog 변환. D-sub등 아날로그 출력에서 필요한 과정으로 보인다.
</li>
</ul>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> *%eax에서 *를 왜 넣는가?</h2>
<div class="outline-text-2" id="text-13">


<ul>
<li>절대주소를 쓸때 * 접두사를 붙여야한다. 기본은 상대주소를 사용한다.
</li>
</ul>


<p>
<a href="http://wiki.osdev.org/Opcode_syntax">Opcode syntax</a>
</p>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> offsetof란??????</h2>
<div class="outline-text-2" id="text-14">


<ul>
<li>offsetof(a,b) 일때 a 구조체 내부의 b의 오프셋을 구하는 매크로
</li>
</ul>


</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> kbuild.h에서 -&gt;의 의미</h2>
<div class="outline-text-2" id="text-15">


<ul>
<li>-&gt;로 시작하는 부분을 sed를 사용해 define으로 치환한다. (ex. -&gt; a b c 는 #define a b <i>* c *</i> 로 변환된다.)
</li>
</ul>


<p>
<a href="../Kbuild#define-sed-y">kbuild</a>
</p>
</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> 세그먼트에 32비트값을 넣을수 있는가?</h2>
<div class="outline-text-2" id="text-16">


<ul>
<li>mov ds,cx와 mov ds,ecx를 컴파일 했을때의 기계어 코드는 같다. segment selector의 크기는 16비트기 때문에 같은 결과가 들어가는 것으로 보인다.
</li>
</ul>


</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> 32모드에서 call할때의 크기</h2>
<div class="outline-text-2" id="text-17">


<ul>
<li>기본적으로 memory operand는 32비트다. 일반 호출시 스택에 증감되는 값도 32비트일 것이다.
</li>
</ul>


</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <code>MSR_IA32_MISC_ENABLE</code></h2>
<div class="outline-text-2" id="text-18">


<ul>
<li>x87 FPU 명령어 지원여부 P4에서 지원한다. 최근에는 지원하지 않는것 같다.
</li>
</ul>


<p>
<a href="http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html">Intel manual Vol3, Table B-13</a>
</p>
</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> PAE의 크기가 어떻게 36비트를 쓰는가?</h2>
<div class="outline-text-2" id="text-19">


<ul>
<li>PAE의 엔트리의 물리 메모리 크기 제한(bits)은 아키텍쳐에 따라 가변적이다. Pentium pro에서부터 36비트를 지원하고 최대 52비트다. (테이블 크기가 4K라면 정렬로 엔트리에는 40비트 사용) 
   CPUID.80000008H:EAX[7:0]의 MAXPHYADDR로 크기를 얻을수 있다.
</li>
</ul>


<p>
<a href="http://msdn.microsoft.com/en-us/windows/hardware/gg487512">msdn</a> 
</p>
<p>
<a href="http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html">Intel manual Vol.3 4.1.4, 4.4</a>
</p>
</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> RIP 상대 주소 지정방법 (RIP-relative addressing)</h2>
<div class="outline-text-2" id="text-20">


<ul>
<li>64비트 모드는 기본 오퍼렌드 크기가 32, 어드레스 크기는 64이기 때문에 다음 명령어 위치에 상대적인 주소지정법인 RIP 지정법이 생겼다.
</li>
</ul>


<p>
<a href="http://kkamagui.tistory.com/781">64비트 멀티코어 OS 원리와 구조, p.87</a>
</p>
</div>

</div>
