study/QnA.org
* GOT란?

- ELF포맷의 영역중 하나. global offset table. 자매품 plt(procedure linkage table)도 있다.

* =__builtin_constant_p=

- 상수면 1을 반환한다. (define...)

* =MSR_GS_BASE=

- Long mode에서 세그먼트 레지스터의 base, limit는 무시된다. 하지만 예외적으로 MSR을 통해 fs와 gs의 base 주소를 변경할수 있다. (FS.base (C000_0100h), GS.base (C000_0101h)

[[http://wiki.osdev.org/X86-64][osdev - x86-64]]

* do { } while (0) 이 많이 쓰이는 이유

- 복잡한 형태의 매크로를 사용가능하게 해주고 if else 문에서 ;이 와도 깨지는걸 방지한다.

- 링크의 예제에서 gcc에서 사용가능한 ({..})의 마지막 라인의 lcl; 은 리턴값이 된다.

    #define FOO(arg) ({         \
               typeof(arg) lcl;     \
               lcl = bar(arg);       \
               lcl;                      \
        })

[[http://taehyo.egloos.com/4131598][리눅스 커널에서 do while(0)을 쓰는 이유]]

[[http://gcc.gnu.org/onlinedocs/gcc-4.1.1/gcc/Statement-Exprs.html#Statement-Exprs][Statements and Declarations in Expressions]]

* inline 어셈에서 세번째 : 필드(list of clobbered registers)에서 "memory"와 "cc"의 의미

- "memory"는 메모리, "cc"는 condition code register(FLAGS register)가 변경되었음을 뜻한다.

[[http://gcc.gnu.org/onlinedocs/gcc/Extended-Asm.html][GCC:Extended ASM]]

[[http://ibiblio.org/gferg/ldp/GCC-Inline-Assembly-HOWTO.html][GCC-inline ASM HOWTO]]

* inline 어셈에서 %h0, %b0 오퍼렌드의 의미

-    %a0 - memory addressed by register operand 0
-    %A0 - operand 0 with a "*" prefix
-    %b0 - 8bit form of register operand 0 (al)
-    %B0 - gives "b"
-    %c0 - operand 0, without $ prefix
-    %h0 - high 8 bit form of register operand 0 (ah)
-    %k0 - 32bit form of register operand 0 (eax)
-    %l0 - operand 0 as label
-    %L0 - gives "l"
-    %n0 - negate operand 0 without $ prefix
-    %O0 - nothing
-    %P0 - same as %c0
-    %q0 - 64bit form of register operand 0 (rax)
-    %Q0 - gives "l"
-    %s0 - operand 0 with a comma appended
-    %S0 - gives "s"
-    %t0 - only usable on immediate operands, does nothing?
-    %T0 - gives "t"
-    %w0 - 16 bit form of register operand 0 (ax)
-    %W0 - gives "w"
-    %x0 - same as %w0
-    %y0 - same as %k0
-    %z0 - Opcode suffix based on operand 0 size (b, w, l), example asm ("mov%z1 %1, %0" : "=r"(ret) : "r"(val));

[[http://non-null.blogspot.com/2009/01/operands-in-gcc-inline-assembly.html][Operands in gcc inline assembly]]

[[http://www.osdever.net/tutorials/view/a-brief-tutorial-on-gcc-inline-asm%3Fthe_id%3D68][A brief tutorial on GCC inline asm (x86 biased)]]

* inline 어셈에서 output, input 필드에 붙는 제약 ex) "=a"

-    "m" : A memory operand is allowed, with any kind of address that the machine supports in general.
-    "o" : A memory operand is allowed, but only if the address is offsettable. ie, adding a small offset to the address gives a valid address.
-    "V" : A memory operand that is not offsettable. In other words, anything that would fit the `m’ constraint but not the `o’constraint.
-    "i" : An immediate integer operand (one with constant value) is allowed. This includes symbolic constants whose values will be known only at assembly time.
-    "n" : An immediate integer operand with a known numeric value is allowed. Many systems cannot support assembly-time constants for operands less than a word wide. Constraints for these operands should use ’n’ rather than ’i’.
-    "g" : Any register, memory or immediate integer operand is allowed, except for registers that are not general registers.

-    "r" : Register operand constraint, look table given above.
-    "q" : Registers a, b, c or d.
-    "I" : Constant in range 0 to 31 (for 32-bit shifts).
-    "J" : Constant in range 0 to 63 (for 64-bit shifts).
-    "K" : 0xff.
-    "L" : 0xffff.
-    "M" : 0, 1, 2, or 3 (shifts for lea instruction).
-    "N" : Constant in range 0 to 255 (for out instruction).
-    "f" : Floating point register
-    "t" : First (top of stack) floating point register
-    "u" : Second floating point register
-    "A" : Specifies the `a’ or `d’ registers. This is primarily useful for 64-bit integer values intended to be returned with the `d’ register holding the most significant bits and the `a’ register holding the least significant bits.

[[http://ibiblio.org/gferg/ldp/GCC-Inline-Assembly-HOWTO.html#s6][GCC-inline asm HOWTO]]

[[info:gcc:Simple%20Constraints][info:gcc:Simple Constraints]]

[[info:gcc:Machine%20Constraints][info:gcc:Machine Constraints]]

* #define =__percpu_arg(x)=		=__percpu_prefix= "%P" #x

: #define __percpu_arg(x)		__percpu_prefix "%P" #x
- =__percpu_prefix= 는 percpu 자료구조가 있는 gs의 segment prefix다. "%P" #x 는 operand 숫자를 뜻한다. %P는 i386에 종속적인 지시자로 추측한다.

실제 예를 들면

- =#define percpu_to_op(op, var, val)= 의 경우는 오퍼랜드 크기에 따라 바이트,워드등으로 변환하는데

:		asm(op "b %1,"__percpu_arg(0)		\
:		    : "+m" (var)			\
:		    : "qi" ((pto_T__)(val)));		\

op는 mov등의 명령어가 넘어오고 =__percpu_arg(0)= 은 인자 %0과 같다.

=percpu_xx_op= 의 인자는 (명령어, dest,src)로 인텔 어셈과 유사하다.

case로 처리를 해줘서 오퍼랜드 크기등에 신경쓸 필요 없다.

* #define # ##

: #define onesharp(x,y) x #y
: #define twosharp(x,y) x ##y

- #는 string으로 결합한다. onesharp("hello",world) == "helloworld"
- ##는 변수명으로 결합한다. twosharp(my,precious) == myprecious

* cgroup이란?
- cpu, 메모리, 네트워크등 다양한 자원을 마운트해서 그룹별로 제한 가능하다. (Control groups)
- init/main.c에서 root cgroups와 =css_set=을 초기화한다.

[[http://www.kernel.org/doc/Documentation/cgroups/cgroups.txt][cgroups kernel document]]
[[http://en.wikipedia.org/wiki/Cgroups][cgroups - wikipedia]]

* =css_set=
- cgroups subsystem state
- cgroups에는 자원별 subsystem이 있는데 이를 관리하기 위한 자료구조로 추측. (좀 더 봐야함)

* 응용프로그램에서 LMA와 VMA를 다르게 하면?
- LMA(물리메모리)는 무시될 것이다.

* 매크로 함수의 리턴값
- 링크를 요약하면 마지막 문장이 일반 함수에서의 리턴값과 의미가 비슷하나 C++에서는 사용을 자제하는게 좋다. ({ ... })는 gcc의 확장기능이다.

http://kldp.org/node/58409

* RCU
- RCU(read-copy-update)란 리스트나 트리구조에서 자료를 보호하기 위한 락킹이다.
- 자료구조를 읽는동안 쓰려고 하면 복제및 링크를 변경해 보호하고 복사본이 원본이 되고 원본은 적절한 시점에 제거한다.

[[http://en.wikipedia.org/wiki/Read-copy-update][RCU wiki]]

http://onestep.tistory.com/32

* sparse란 무엇인가?
- sparse는 리눅스 커널을 위해 만든 코드 체크용 툴이다. 아래와 같이 사용한다.

: __attribute__((address_space(num)))

[[file:../include/linux/compiler.h::define%20__kernel%20__attribute__%20address_space%200][compiler.h]]

- sparse는 메모리 모델중 하나이다. 메모리 섹션이 나누어져 있어 특정 섹션을 online, offline 시킬수 있다.
[[http://www.iamroot.org/xe/13649][iamroot sparse memory 관련 질답]]

