study/QnA.html

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> GOT란?</h2>
<div class="outline-text-2" id="text-21">


<ul>
<li>ELF포맷의 영역중 하나. global offset table. 자매품 plt(procedure linkage table)도 있다.
</li>
</ul>


</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <code>__builtin_constant_p</code></h2>
<div class="outline-text-2" id="text-22">


<ul>
<li>상수면 1을 반환한다. (define&hellip;)
</li>
</ul>


</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <code>MSR_GS_BASE</code></h2>
<div class="outline-text-2" id="text-23">


<ul>
<li>Long mode에서 세그먼트 레지스터의 base, limit는 무시된다. 하지만 예외적으로 MSR을 통해 fs와 gs의 base 주소를 변경할수 있다. (FS.base (C000<sub>0100h</sub>), GS.base (C000<sub>0101h</sub>)
</li>
</ul>


<p>
<a href="http://wiki.osdev.org/X86-64">osdev - x86-64</a>
</p>
</div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> do { } while (0) 이 많이 쓰이는 이유</h2>
<div class="outline-text-2" id="text-24">


<ul>
<li>복잡한 형태의 매크로를 사용가능하게 해주고 if else 문에서 ;이 와도 깨지는걸 방지한다.

</li>
<li>링크의 예제에서 gcc에서 사용가능한 ({..})의 마지막 라인의 lcl; 은 리턴값이 된다.

<p>
    #define FOO(arg) ({         \
               typeof(arg) lcl;     \
               lcl = bar(arg);       \
               lcl;                      \
        })
</p></li>
</ul>


<p>
<a href="http://taehyo.egloos.com/4131598">리눅스 커널에서 do while(0)을 쓰는 이유</a>
</p>
<p>
<a href="http://gcc.gnu.org/onlinedocs/gcc-4.1.1/gcc/Statement-Exprs.html#Statement-Exprs">Statements and Declarations in Expressions</a>
</p>
</div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> inline 어셈에서 세번째 : 필드(list of clobbered registers)에서 "memory"와 "cc"의 의미</h2>
<div class="outline-text-2" id="text-25">


<ul>
<li>"memory"는 메모리, "cc"는 condition code register(FLAGS register)가 변경되었음을 뜻한다.
</li>
</ul>


<p>
<a href="http://gcc.gnu.org/onlinedocs/gcc/Extended-Asm.html">GCC:Extended ASM</a>
</p>
<p>
<a href="http://ibiblio.org/gferg/ldp/GCC-Inline-Assembly-HOWTO.html">GCC-inline ASM HOWTO</a>
</p>
</div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> inline 어셈에서 %h0, %b0 오퍼렌드의 의미</h2>
<div class="outline-text-2" id="text-26">


<ul>
<li>%a0 - memory addressed by register operand 0
</li>
<li>%A0 - operand 0 with a "*" prefix
</li>
<li>%b0 - 8bit form of register operand 0 (al)
</li>
<li>%B0 - gives "b"
</li>
<li>%c0 - operand 0, without $ prefix
</li>
<li>%h0 - high 8 bit form of register operand 0 (ah)
</li>
<li>%k0 - 32bit form of register operand 0 (eax)
</li>
<li>%l0 - operand 0 as label
</li>
<li>%L0 - gives "l"
</li>
<li>%n0 - negate operand 0 without $ prefix
</li>
<li>%O0 - nothing
</li>
<li>%P0 - same as %c0
</li>
<li>%q0 - 64bit form of register operand 0 (rax)
</li>
<li>%Q0 - gives "l"
</li>
<li>%s0 - operand 0 with a comma appended
</li>
<li>%S0 - gives "s"
</li>
<li>%t0 - only usable on immediate operands, does nothing?
</li>
<li>%T0 - gives "t"
</li>
<li>%w0 - 16 bit form of register operand 0 (ax)
</li>
<li>%W0 - gives "w"
</li>
<li>%x0 - same as %w0
</li>
<li>%y0 - same as %k0
</li>
<li>%z0 - Opcode suffix based on operand 0 size (b, w, l), example asm ("mov%z1 %1, %0" : "=r"(ret) : "r"(val));
</li>
</ul>


<p>
<a href="http://non-null.blogspot.com/2009/01/operands-in-gcc-inline-assembly.html">Operands in gcc inline assembly</a>
</p>
<p>
<a href="http://www.osdever.net/tutorials/view/a-brief-tutorial-on-gcc-inline-asm?the_id=68">A brief tutorial on GCC inline asm (x86 biased)</a>
</p>
</div>

</div>

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> inline 어셈에서 output, input 필드에 붙는 제약 ex) "=a"</h2>
<div class="outline-text-2" id="text-27">


<ul>
<li>"m" : A memory operand is allowed, with any kind of address that the machine supports in general.
</li>
<li>"o" : A memory operand is allowed, but only if the address is offsettable. ie, adding a small offset to the address gives a valid address.
</li>
<li>"V" : A memory operand that is not offsettable. In other words, anything that would fit the `m’ constraint but not the `o’constraint.
</li>
<li>"i" : An immediate integer operand (one with constant value) is allowed. This includes symbolic constants whose values will be known only at assembly time.
</li>
<li>"n" : An immediate integer operand with a known numeric value is allowed. Many systems cannot support assembly-time constants for operands less than a word wide. Constraints for these operands should use ’n’ rather than ’i’.
</li>
<li>"g" : Any register, memory or immediate integer operand is allowed, except for registers that are not general registers.

</li>
<li>"r" : Register operand constraint, look table given above.
</li>
<li>"q" : Registers a, b, c or d.
</li>
<li>"I" : Constant in range 0 to 31 (for 32-bit shifts).
</li>
<li>"J" : Constant in range 0 to 63 (for 64-bit shifts).
</li>
<li>"K" : 0xff.
</li>
<li>"L" : 0xffff.
</li>
<li>"M" : 0, 1, 2, or 3 (shifts for lea instruction).
</li>
<li>"N" : Constant in range 0 to 255 (for out instruction).
</li>
<li>"f" : Floating point register
</li>
<li>"t" : First (top of stack) floating point register
</li>
<li>"u" : Second floating point register
</li>
<li>"A" : Specifies the `a’ or `d’ registers. This is primarily useful for 64-bit integer values intended to be returned with the `d’ register holding the most significant bits and the `a’ register holding the least significant bits.
</li>
</ul>


<p>
<a href="http://ibiblio.org/gferg/ldp/GCC-Inline-Assembly-HOWTO.html#s6">GCC-inline asm HOWTO</a>
</p>
<p>
<i>&lt;info:gcc:Simple Constraints&gt;</i>
</p>
<p>
<i>&lt;info:gcc:Machine Constraints&gt;</i>
</p>
</div>

</div>

<div id="outline-container-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> #define <code>__percpu_arg(x)</code>             <code>__percpu_prefix</code> "%P" #x</h2>
<div class="outline-text-2" id="text-28">


<pre class="example">
#define __percpu_arg(x)               __percpu_prefix "%P" #x
</pre>

<ul>
<li><code>__percpu_prefix</code> 는 percpu 자료구조가 있는 gs의 segment prefix다. "%P" #x 는 operand 숫자를 뜻한다. %P는 i386에 종속적인 지시자로 추측한다.
</li>
</ul>


<p>
실제 예를 들면
</p>
<ul>
<li><code>#define percpu_to_op(op, var, val)</code> 의 경우는 오퍼랜드 크기에 따라 바이트,워드등으로 변환하는데
</li>
</ul>


<pre class="example">
              asm(op "b %1,"__percpu_arg(0)           \
                  : "+m" (var)                        \
                  : "qi" ((pto_T__)(val)));           \
</pre>


<p>
op는 mov등의 명령어가 넘어오고 <code>__percpu_arg(0)</code> 은 인자 %0과 같다.
</p>
<p>
<code>percpu_xx_op</code> 의 인자는 (명령어, dest,src)로 인텔 어셈과 유사하다.
</p>
<p>
case로 처리를 해줘서 오퍼랜드 크기등에 신경쓸 필요 없다.
</p>
</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> #define # ##</h2>
<div class="outline-text-2" id="text-29">


<pre class="example">
#define onesharp(x,y) x #y
#define twosharp(x,y) x ##y
</pre>


<ul>
<li>#는 string으로 결합한다. onesharp("hello",world) == "helloworld"
</li>
<li>##는 변수명으로 결합한다. twosharp(my,precious) == myprecious
</li>
</ul>


</div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> cgroup이란?</h2>
<div class="outline-text-2" id="text-30">

<ul>
<li>cpu, 메모리, 네트워크등 다양한 자원을 마운트해서 그룹별로 제한 가능하다. (Control groups)
</li>
<li>init/main.c에서 root cgroups와 =css<sub>set</sub>=을 초기화한다.
</li>
</ul>


<p>
<a href="http://www.kernel.org/doc/Documentation/cgroups/cgroups.txt">cgroups kernel document</a>
<a href="http://en.wikipedia.org/wiki/Cgroups">cgroups - wikipedia</a>
</p>
</div>

</div>

<div id="outline-container-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> <code>css_set</code></h2>
<div class="outline-text-2" id="text-31">

<ul>
<li>cgroups subsystem state
</li>
<li>cgroups에는 자원별 subsystem이 있는데 이를 관리하기 위한 자료구조로 추측. (좀 더 봐야함)
</li>
</ul>


</div>

</div>

<div id="outline-container-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> 응용프로그램에서 LMA와 VMA를 다르게 하면?</h2>
<div class="outline-text-2" id="text-32">

<ul>
<li>LMA(물리메모리)는 무시될 것이다.
</li>
</ul>


</div>

</div>

<div id="outline-container-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> 매크로 함수의 리턴값</h2>
<div class="outline-text-2" id="text-33">

<ul>
<li>링크를 요약하면 마지막 문장이 일반 함수에서의 리턴값과 의미가 비슷하나 C++에서는 사용을 자제하는게 좋다. ({ &hellip; })는 gcc의 확장기능이다.
</li>
</ul>


<p>
<a href="http://kldp.org/node/58409">http://kldp.org/node/58409</a>
</p>
</div>

</div>

<div id="outline-container-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> RCU</h2>
<div class="outline-text-2" id="text-34">

<ul>
<li>RCU(read-copy-update)란 리스트나 트리구조에서 자료를 보호하기 위한 락킹이다.
</li>
<li>자료구조를 읽는동안 쓰려고 하면 복제및 링크를 변경해 보호하고 복사본이 원본이 되고 원본은 적절한 시점에 제거한다.
</li>
</ul>


<p>
<a href="http://en.wikipedia.org/wiki/Read-copy-update">RCU wiki</a>
</p>
<p>
<a href="http://onestep.tistory.com/32">http://onestep.tistory.com/32</a>
</p>
</div>

</div>

<div id="outline-container-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> sparse란 무엇인가?</h2>
<div class="outline-text-2" id="text-35">

<ul>
<li>sparse는 리눅스 커널을 위해 만든 코드 체크용 툴이다. 아래와 같이 사용한다.
</li>
</ul>


<pre class="example">
__attribute__((address_space(num)))
</pre>


<p>
<a href="../include/linux/compiler.h#define-__kernel-__attribute__-address_space-0">compiler.h</a>
</p>
<ul>
<li>sparse는 메모리 모델중 하나이다. 메모리 섹션이 나누어져 있어 특정 섹션을 online, offline 시킬수 있다.
</li>
</ul>

<p><a href="http://www.iamroot.org/xe/13649">iamroot sparse memory 관련 질답</a>
</p>
</div>

</div>
