study/QnA.org
* =__force_order=
- clobber의 "memory" 표시는 성능을 저해하고 volatile만으로 컴파일러 reordering을 막기엔 부족하다.
- arch/x86/include/asm/system.h 주석 참조

[[file:../arch/x86/include/asm/system.h::use%20a%20variable%20and%20mimic%20reads%20and%20writes%20to%20it%20to%20enforce%20serialization][force order 사용이유]]

* as의 .pushsection, .popsection, .previous
- .pushsection은 현재 섹션을 스택에 넣고 현재 섹션을 뒤에오는 section,subsection으로 바꾼다.
- .popsection은 스택에서 마지막 섹션을 빼서 현재 섹션에 넣는다.
- .previous는 가장 최근의 section/subsection으로 바꾼다.

[[http://sourceware.org/binutils/docs/as/Pseudo-Ops.html#Pseudo-Ops][GAS - assembler directive]]

* const struct =cpu_dev= *const *cdev
- a pointer to const pointer to const struct
- cdev 포인터만 바꿀수 있다. *cdev와 **cdev등은 const

* const int와 int *const의 차이

:   +---------------------------------------------------------------+
:   |Const usage |Meaning          |Description                     |
:   |------------+-----------------+--------------------------------|
:   |const int   |Pointer to a     |Value pointed to by x can’t     |
:   |*x;         |const int        |change                          |
:   |------------+-----------------+--------------------------------|
:   |int * const |Const pointer to |x cannot point to a different   |
:   |x;          |an int           |location.                       |
:   |------------+-----------------+--------------------------------|
:   |const int   |Const pointer to |Both the pointer and the value  |
:   |*const x;   |a const int      |pointed to cannot change.       |
:   +---------------------------------------------------------------+


[[http://social.msdn.microsoft.com/Forums/en-US/vcgeneral/thread/59572c5d-05a4-492f-b52e-4823d9fa7a88][MSDN : What are the differences between const int*, int * const, and const int * const?]]

* intel vt 에서 ldtr을 세팅하면 intel vt가 happy한 이유는?

- intel vt는 인텔의 가상화 기술이다. 보호모드 일때 intel vt는 완전한 초기화가 이루어지지 않는 상황을 싫어한다. 그래서 ldt와 tr는 잘 사용하지 않는데도 0과 더미값으로 초기화시켜준다. 

[[http://git.et.redhat.com/%3Fp%3Dkernel-kraxel.git%3Ba%3Dcommitdiff_plain%3Bh%3D88089519f302f1296b4739be45699f06f728ec31][Subject: x86 setup: initialize LDTR and TR to make life easier to Intel VT]]

[[file:~/linux-x86-8/arch/x86/boot/pmjump.S::Set%20up%20TR%20to%20make%20Intel%20VT%20happy][pmjump.S]]

* cpu family 값
- CPUID EAX=1은 cpu의 tfms(type, family, model, stepping)값을 반환한다.
- Intel은 486=4, Pentium=5, Pentium Pro/II/III=6, P4(netburst)=15, 이후 core microarchitecture부터는 6값으로 회귀했다. 아이테니엄은 7, 16, 17이다.
- AMD는 Am5x86=4, K5/6=5, Athlon(K7)=6, Athlon64(K8)=15, K10=16, Bobcat=20, Bulldozer=21

[[http://en.wikipedia.org/wiki/List_of_AMD_CPU_microarchitectures][AMD CPU list]]

[[http://www.pagetable.com/%3Fp%3D18][Intel cpu family ID]]

[[http://web.inter.nl.net/hcc/J.Steunebrink/chkcpu.htm][chkcpu]]

[[http://www.ukcpu.net/Programming/OS/cpuid.txt][cpuid.txt]]

* =native_read_msr= 의 =EAX_EDX_VAL= 매크로에서 32/64비트를 "a" "d", "A"를 나눠놓은 이유
- x86의 일부 명령어는 edx:eax 레지스터를 사용한다. gcc 인라인 어셈의 output/input 필드에서 "A" 는 32비트에서는 edx:eax를 나타내지만 64비트에서는 rdx 또는 rax를 나타내기 때문에 제대로 동작하지 않는다.
- "a"와 "d"를 나눠서 처리하는 것보다 "A"로 알려주는게 변수할당이나 소스 길이(속도)등에서 이득이다.

[[file:~/linux-x86-8/arch/x86/include/asm/msr.h::define%20EAX_EDX_VAL%20val%20low%20high%20low%20u64%20high%2032][msr.h]]

* =atomic_set= 에서 mov에는 왜 lock prefix가 안붙는가?
- 아키텍쳐에서 load/store와 레지스터끼리의 연산은 원자성을 보장한다.

* =__this_fixmap_does_not_exist= 함수는 선언이 안되있는 이유?
- 인자가 상수값으로 들어오면 최적화 옵션을 주면 에러를 내지 않는다. 혹은 함수 내부에서 둘 다 상수를 사용하면 최적화 옵션을 주지 않아도 에러를 내지 않는다.

* Write combining이란?
- x86의 캐시정책중 하나이다. =x86_64= 아키텍쳐에는 UC, WT, WP, WC, WB의 다섯가지 캐시정책이 있고 MTRR(memory type range registers)와 PAT(Page attribute table)로 메모리의 캐시정책을 결정한다.
이중 WC는 순차적인 쓰기에서 뛰어난 성능을 보인다.

